{
    "whiteMove": "White's move",
    "blackMove": "Black's move",
    "findBestMove" : "Find the best move",
    "puzzleFinished": "Good, puzzle finished!",
    "puzzleContinue": "Good, continue!",
    "puzzleWrong" : "Wrong, try again",
    "undo" : "Undo",
    "pause": "Pause",
    "hint": "Hint",
    "play": "Play",
    "puzzles": "Puzzles",
    "reviewLast": "Review last",
    "recentGames" : "Recent games",
    "selectOpponent" : "Select Opponent",
    "selectTime": "Configure Time",
    "selectRules": "Configure Rules",

    "omegaBot" : "OmegaBot",
    "omegaDisc": "(Not recommended), custom bot",
    "restBot": "Cloud Stockfish",
    "restDisc": "Works only with web conection",
    "nativeBot": "Local Stockfish",
    "nativeDisc" : "Works only on mobile devices",
    "overBoard": "Over the Board",
    "overBoardDisc": "Play with other player on one device",
    "strength": "Strenght",
    "selectedLevel": "Selected Level",
    "estimatedElo": "Estimated ELO",

    "bullet": "Bullet",
    "blitz": "Blitz",
    "rapid": "Rapid",
    "classical": "Classical",
    "customTime" : "Custom Time",
    "baseTimeDisc": "Base time - minutes",
    "addTimeDisc": "Added time - seconds",

    "eloLevel" : "Elo Level",
    "everything" : "Everything",
    "rookEnding": "Rook ending",
    "queenEnding": "Queen Ending",
    "knightEnding": "Knight Ending",
    "bishopEnding": "Bishop Ending",
    "fork": "Fork",
    "opening": "Opening",
    "midGame": "Middlegame",
    "endGame" : "Endgame",
    "promotion" : "Promotion",

    "ruyLopezDisc": "The Ruy Lopez, also known as the Spanish Opening, is a classic that immediately creates tension by attacking Black's knight. This venerable opening offers deep positional and tactical possibilities, leading to both sharp and strategic battles. It's a versatile and enduring choice, providing rich play for all chess levels.",
    "italianGameDisc": "The Italian Game is a time-honored opening that focuses on rapid development and central control, characterized by White's bishop on c4. It directly targets Black's vulnerable f7 square, creating immediate pressure and tactical opportunities. This versatile opening can lead to both slower, positional games and sharp, attacking battles, making it a favorite for players of all styles.",
    "scothGameDisc": "The Scotch Game is an aggressive opening that challenges Black's center early by playing 3. d4. This direct approach often leads to open, tactical positions and rapid piece development for both sides. It's a dynamic choice for players seeking to avoid the more theoretical lines of the Ruy Lopez or Italian Game.",
    "evansGambitDisc": "The Evans Gambit, a daring offshoot of the Italian Game, sacrifices a pawn early to gain rapid development and central control. This aggressive opening aims to open lines for White's pieces and launch immediate attacks. It's a favorite for players who enjoy sharp, tactical battles and are willing to take risks for the initiative.",
    "kingsIndianAttackDisc": "The King's Indian Attack (KIA) is a flexible opening system for White, characterized by a kingside fianchetto and a solid pawn structure. Rather than forcing early central conflict, White aims for a stable setup to launch a powerful kingside attack. It's a versatile choice that can be employed against various Black defenses, making it popular for players who prefer understanding ideas over memorizing extensive theory.",
    "londonSystemDisc": "The London System is a reliable and flexible opening system for White, emphasizing solid development and a robust pawn structure around d4. It focuses on consistent piece placement and aims for a comfortable position without early tactical complications. This versatile opening is favored by players who prefer a strategic and adaptable approach, often leading to manageable middlegames.",
    "queensGambitDisc": "The Queen's Gambit is one of the oldest and most respected chess openings, offering a pawn to gain rapid development and central control. White's early 2. c4 challenges Black's d5 pawn, aiming to dominate the center and open lines for pieces. This highly strategic opening often leads to rich positional battles and is a cornerstone of classical chess theory.",
    "caroKannDisc": "The Caro-Kann Defense is a solid and resilient opening for Black, characterized by the move 1...c6. Black aims for a strong pawn structure, often involving an early ...d5, to contest the center and create a safe king position. It's a popular choice for players seeking a robust and less tactical defense against 1. e4, often leading to sound positional play.",
    "kingsIndianDefenseDisc": "The King's Indian Defense is a dynamic and aggressive opening for Black, characterized by a kingside fianchetto and an immediate challenge to White's center with ...d6 and ...e5. Black often concedes central space early to launch a powerful counterattack on the kingside or expand on the queenside. It's a complex and exciting choice for players who thrive in sharp, tactical positions and enjoy counter-attacking play.",
    "acceleratedDragonDisc": "The Accelerated Dragon is a sharp and modern variation of the Sicilian Defense, where Black plays 2...g6 and 3...Bg7, fianchettoing their kingside bishop quickly. This aims to speed up development and put pressure on White's center without allowing some of the more restrictive anti-Sicilian lines. It's a dynamic and active choice for players who enjoy tactical complexities and an open game.",
    "slavDefenseDisc" : "The Slav Defense is a highly solid and principled opening for Black, characterized by the moves 1. d4 d5 2. c4 c6. Black aims to support their d5 pawn and maintain a strong pawn structure, often involving the recapture of the c4 pawn with ...dxc4. It's a popular choice for players seeking a robust and reliable defense against the Queen's Gambit, often leading to strategic and balanced games.",

    "darkModeAuto" : "Auto",
    "darkModeOn": "On",
    "darkModeOff": "Off",
    "DarkMode": "Dark Mode",
    "colorScheme": "Color Scheme",
    "useAutoColor": "Auto Color Scheme",
    "LightMode": "Light Mode",
    "AutoMode": "Auto",
    "showBoardIndexes": "Show coordinates",
    "language": "Language",
    "useSounds": "Sounds",
    "useHaptics": "Haptics",
    "Settings": "Settings",
    "about": "About",
    "learn": "Learn",
    "pawn": "Pawn",
    "knight": "Knight",
    "bishop": "Bishop",
    "queen": "Queen",
    "rook": "Rook",
    "king": "King",
    "advancedPlays": "Advanced Plays",
    "openings": "Openings",
    "ruyLopez": "Ruy Lopez",
    "italianGame": "Italian Game",
    "scotchGame": "Scotch Game",
    "evansGambit": "Evans Gambit",
    "kingsIndianAttack": "King's Indian attack",
    "londonSystem": "London System",
    "queensGambit": "Queen's Gambit",
    "caroKann": "Caro-Kann",
    "slavDefense": "Slav defense",
    "kingsIndianDefense": "King's Indian defense",
    "acceleratedDragon": "Accelerated Dragon",
    "whiteOpenings": "White Openings",
    "blackOpenings": "Black Openings",
    "Apperance": "Apperance",
    "ApperanceDisc": "Dark Mode, Colors",
    "sounds": "Sounds",
    "soundsDisc": "Audio, Haptics",
    "board": "Board",
    "boardDisc": "Configure the look and behaviour of the board",
    "blackWon": "Black has won",
    "whiteWon": "White has won",
    "draw": "Draw",
    "byCheckmate": "By Checkmate",
    "byMaterial": "By Insufficient material",
    "byStalemate": "By Stalemate",
    "byResign": "By resignation",
    "byTime": "On time",

    "pawnDisc":"The smallest but numerous pieces, pawns move straight forward one square at a time. On their very first move, they have the option to move two squares forward. They are unique because they capture enemy pieces diagonally one square forward, and they can never move backward.",
    "knightDisc": "Knights have a unique 'L-shaped' move: two squares in one direction (horizontally or vertically) and then one square perpendicularly. They are the only pieces that can jump over other pieces, making them excellent for navigating crowded boards and attacking from unexpected positions.",
    "bishopDisc": "Bishops move diagonally any number of squares in a straight line. Each bishop starts on a specific color square (either light or dark) and must stay on squares of that same color throughout the entire game. This means one bishop covers all the light squares, and the other covers all the dark squares.",
    "rookDisc": "Rooks are powerful straight-line movers, capable of moving any number of squares horizontally or vertically. They are often strong pieces in the later stages of the game when the board opens up. Rooks also play a special role in a move called 'castling' with the king.",
    "queenDisc": "The queen is the most powerful piece on the board, combining the moves of both a rook and a bishop. She can move any number of squares in any straight direction—horizontally, vertically, or diagonally. Her versatility makes her a constant threat to the opponent.",
    "kingDisc": "The king is the most important piece, even though it moves only one square at a time in any direction (horizontally, vertically, or diagonally). The primary goal of the game is to 'checkmate' the opponent's king, meaning it is under attack and has no safe square to move to. Protecting your king is paramount to winning the game.",

    "advancedMoves": "Advanced Moves",
    "tactics": "Tactics",
    "castle": "Castle",
    "enPassant": "En Passant",
    "pinning": "Pinning",
    "forks": "Forks",
    "discoveredAttacks": "Discovered Attacks",

    "castleDisc" : "Castling is a special chess move involving the king and one of the rooks. It allows the king to move two squares towards the rook, and the rook then jumps to the square the king crossed. This move can only be performed if neither the king nor the rook has moved previously, and there are no pieces between them.",
    "enPassantDisc": "En passant (French for 'in passing') is a special pawn capture in chess. It occurs when an opponent's pawn moves two squares forward from its starting position and lands directly beside your pawn. On your immediate next turn, you can capture that pawn as if it had only moved one square, landing your pawn on the square the opponent's pawn 'passed over.'",
    "pinningDisc" : "In chess, a 'pin' is a tactical situation where an attacking piece (usually a rook, bishop, or queen) prevents an opponent's piece from moving without exposing a more valuable piece or target behind it. If the piece is pinned to the king, it's an 'absolute pin' and the pinned piece cannot legally move, as doing so would put the king in check. If it's pinned to a less valuable piece (like a queen or rook), it's a 'relative pin,' meaning the piece can move, but it would result in a material loss.",
    "forksDisc": "A fork in chess is a tactical maneuver where a single attacking piece threatens two or more of an opponent's pieces simultaneously. The opponent can usually only move one of the threatened pieces to safety, leading to the loss of the other. Knights are particularly good at creating forks due to their unique L-shaped movement, but other pieces like bishops, rooks, queens, and even pawns can also execute forks.",
    "discoveredAttacksDisc":"A discovered attack in chess happens when you move one of your pieces, revealing a hidden attack by another piece behind it. This creates two threats simultaneously, often catching the opponent off guard, as they can usually only address one of the threats. When the revealed attack is a check, it's called a 'discovered check,'' which is particularly potent because the opponent must respond to the check, allowing you to often capture the other threatened piece.",

    "languageDisc" : "Set the language",
    "customFen": "Custom position in FEN",

    "useAnimations": "Animations",

    "botError": "Bot Error"





}