{
    "whiteMove": "Ruch białego",
    "blackMove": "Ruch czarnego",
    "findBestMove" : "Znajdź najlepszy ruch",
    "puzzleFinished": "Dobrze! Ukończono zadanie",
    "puzzleContinue": "Dobrze! Kontynuuj",
    "puzzleWrong" : "Źle, spróbuj ponownie",
    "undo" : "Cofanie",
    "pause": "Pauza",
    "hint": "Podpowiedź",
    "play": "Graj",
    "puzzles": "Zadania",
    "reviewLast": "Przeglądnij ostatnią",
    "recentGames" : "Ostatnie gry",
    "selectOpponent" : "Wybierz przeciwnika",
    "selectTime": "Ustaw czas",
    "selectRules": "Ustaw zasady",

    "omegaBot" : "OmegaBot",
    "omegaDisc": "(Nie zalecany) Własny bot",
    "restBot": "Stockfish w chmurze",
    "restDisc": "Wymagane połączenie internetowe",
    "nativeBot": "Lokalny Stocfish",
    "nativeDisc" : "Działa tylko na urządeniach mobilnych",
    "overBoard": "Przekaż i graj",
    "overBoardDisc": "Graj z drugim graczem",
    "strength": "Siła",
    "selectedLevel": "Wybrany poziom",
    "estimatedElo": "Przybliżone ELO",

    "bullet": "Bullet",
    "blitz": "Blitz",
    "rapid": "Rapid",
    "classical": "Klasyczny",
    "customTime" : "Inny czas",
    "baseTimeDisc": "Czas bazowy - minuty",
    "addTimeDisc": "Czas dodawany - sekundy",

    "eloLevel" : "Poziom ELO",
    "everything" : "Wszystkie",
    "rookEnding": "Końcówka wieżowa",
    "queenEnding": "Końcówka królową",
    "knightEnding": "Końcówka skoczkiem",
    "bishopEnding": "Końcówka gońcem",
    "fork": "Wiedłki",
    "opening": "Otwarcia",
    "midGame": "Gra środkowa",
    "endGame" : "Końcówka",
    "promotion" : "Promocja",


    "ruyLopezDisc": "Partia Hiszpańska, znana również jako Ruy Lopez, to klasyczne otwarcie, które natychmiast tworzy napięcie, atakując skoczka czarnych. To wiekowe otwarcie oferuje głębokie możliwości pozycyjne i taktyczne, prowadząc zarówno do ostrych, jak i strategicznych bitew. Jest to wszechstronny i trwały wybór, zapewniający bogatą grę na wszystkich poziomach szachowych.",
    "italianGameDisc": "Partia Włoska to czcigodne otwarcie, które koncentruje się na szybkim rozwoju i kontroli centrum, charakteryzujące się białym gońcem na c4. Bezpośrednio atakuje wrażliwe pole f7 czarnych, tworząc natychmiastową presję i taktyczne możliwości. To wszechstronne otwarcie może prowadzić zarówno do wolniejszych, pozycyjnych partii, jak i ostrych, atakujących bitew, co czyni je ulubionym wyborem dla graczy wszystkich stylów.",
    "scothGameDisc": "Partia Szkocka to agresywne otwarcie, które wcześnie rzuca wyzwanie centrum czarnych, grając 3. d4. To bezpośrednie podejście często prowadzi do otwartych, taktycznych pozycji i szybkiego rozwoju figur dla obu stron. Jest to dynamiczny wybór dla graczy pragnących uniknąć bardziej teoretycznych linii Partii Hiszpańskiej lub Włoskiej.",
    "evansGambitDisc": "Gambit Evansa, śmiała odnoga Partii Włoskiej, poświęca piona wcześnie, aby uzyskać szybki rozwój i kontrolę centrum. To agresywne otwarcie ma na celu otwarcie linii dla figur białych i rozpoczęcie natychmiastowych ataków. Jest to ulubiony wybór dla graczy, którzy lubią ostre, taktyczne bitwy i są skłonni podjąć ryzyko dla inicjatywy.",
    "kingsIndianAttackDisc": "Atak Indyjski Króla (KIA) to elastyczny system otwarcia dla białych, charakteryzujący się fianchetto królewskiego skrzydła i solidną strukturą pionków. Zamiast wymuszać wczesny konflikt w centrum, białe dążą do stabilnego ustawienia, aby rozpocząć potężny atak na królewskie skrzydło. Jest to wszechstronny wybór, który może być stosowany przeciwko różnym obronom czarnych, co czyni go popularnym wśród graczy, którzy wolą rozumieć idee niż zapamiętywać obszerną teorię.",
    "londonSystemDisc": "System Londyński to niezawodny i elastyczny system otwarcia dla białych, kładący nacisk na solidny rozwój i solidną strukturę pionków wokół d4. Koncentruje się na spójnym ustawieniu figur i dąży do komfortowej pozycji bez wczesnych komplikacji taktycznych. To wszechstronne otwarcie jest preferowane przez graczy, którzy wolą strategiczne i adaptacyjne podejście, często prowadzące do łatwych do opanowania pozycji w środkowej fazie gry.",
    "queensGambitDisc": "Gambit Hetmański to jedno z najstarszych i najbardziej szanowanych otwarć szachowych, oferujące piona w celu uzyskania szybkiego rozwoju i kontroli centrum. Wczesne 2. c4 białych rzuca wyzwanie pionkowi d5 czarnych, mając na celu zdominowanie centrum i otwarcie linii dla figur. To wysoce strategiczne otwarcie często prowadzi do bogatych bitew pozycyjnych i jest kamieniem węgielnym klasycznej teorii szachowej.",
    "caroKannDisc": "Obrona Caro-Kann to solidne i odporne otwarcie dla czarnych, charakteryzujące się ruchem 1...c6. Czarne dążą do silnej struktury pionków, często z wczesnym ...d5, aby walczyć o centrum i stworzyć bezpieczną pozycję króla. Jest to popularny wybór dla graczy szukających solidnej i mniej taktycznej obrony przeciwko 1. e4, często prowadzącej do solidnej gry pozycyjnej.",
    "kingsIndianDefenseDisc": "Obrona Indyjska Króla to dynamiczne i agresywne otwarcie dla czarnych, charakteryzujące się fianchetto królewskiego skrzydła i natychmiastowym wyzwaniem centrum białych z ...d6 i ...e5. Czarne często wcześnie oddają przestrzeń w centrum, aby rozpocząć potężny kontratak na królewskim skrzydle lub ekspansję na skrzydle hetmańskim. Jest to złożony i ekscytujący wybór dla graczy, którzy rozwijają się w ostrych, taktycznych pozycjach i lubią grę z kontratakiem.",
    "acceleratedDragonDisc": "Przyspieszony Smok to ostra i nowoczesna odmiana Obrony Sycylijskiej, w której czarne grają 2...g6 i 3...Bg7, szybko fianchettując swojego gońca na królewskim skrzydle. Ma to na celu przyspieszenie rozwoju i wywarcie presji na centrum białych, unikając niektórych bardziej restrykcyjnych linii anty-sycylijskich. Jest to dynamiczny i aktywny wybór dla graczy, którzy lubią taktyczne złożoności i otwartą grę.",
    "slavDefenseDisc": "Obrona Słowiańska to bardzo solidne otwarcie dla czarnych, charakteryzujące się ruchami 1. d4 d5 2. c4 c6. Czarne dążą do wsparcia swojego piona d5 i utrzymania silnej struktury pionków, często z odbiciem piona c4 za pomocą ...dxc4. Jest to popularny wybór dla graczy szukających solidnej i niezawodnej obrony przeciwko Gambitowi Hetmańskiemu, często prowadzącej do strategicznych i zrównoważonych partii.",

    "darkModeAuto" : "Auto",
    "darkModeOn": "Wyłączony",
    "darkModeOff": "Włączony",
    "DarkMode": "Tryb Ciemny",
    "colorScheme": "Kolory",
    "useAutoColor": "Automatyczny Kolor",
    "LightMode": "Tryb jasny",
    "AutoMode": "Auto",
    "showBoardIndexes": "Pokaż koordynaty",
    "language": "Język",
    "useSounds": "Dźwięki",
    "useHaptics": "Wibracje",
    "Settings": "Ustawienia",
    "about": "O aplikacji",
    "learn": "Ucz się",
    "pawn": "Pionek",
    "knight": "Skoczek",
    "bishop": "Goniec",
    "queen": "Hetman",
    "rook": "Wieża",
    "king": "Król",
    "advancedPlays": "Zaawansowane zagrania",
    "openings": "Otwarcie",
    "ruyLopez": "Gra Hiszpańska",
    "italianGame": "Gra Włoska",
    "scotchGame": "Gra Szkocka",
    "evansGambit": "Gambit Evansa",
    "kingsIndianAttack": "Atak Indyjski Króla",
    "londonSystem": "System Londyjski",
    "queensGambit": "Gambit hetmański",
    "caroKann": "Caro-Kann",
    "slavDefense": "Obrona Słowiańska",
    "kingsIndianDefense": "Obrona Indyjska Króla",
    "acceleratedDragon": "Przyspieszone smocze otwarcie",
    "whiteOpenings": "Białe otwarcia",
    "blackOpenings": "Czarne otwarcia",
    "Apperance": "Wygląd",
    "ApperanceDisc": "Tryb ciemny, kolory",
    "sounds": "Dźwięki",
    "soundsDisc": "Audio, Wibracje",
    "board": "Plansza",
    "boardDisc": "Skonfiguruj zachowanie planszy",
    "blackWon": "Czarny wygrał",
    "whiteWon": "Biały wygrał",
    "draw": "Remis",
    "byCheckmate": "Przez mata",
    "byMaterial": "Przez niewystarczający materiał",
    "byStalemate": "Przez pata",
    "byResign": "Przez rezygnację",
    "byTime": "Na czas",

    "pawnDisc": "Piony, choć najmniejsze, są najliczniejsze. Poruszają się prosto do przodu o jedno pole. W swoim pierwszym ruchu mają możliwość przesunięcia się o dwa pola do przodu. Są wyjątkowe, ponieważ biją figury przeciwnika po przekątnej o jedno pole do przodu i nigdy nie mogą cofnąć się.",
    "knightDisc": "Skoczki mają unikalny ruch w kształcie litery 'L': dwa pola w jednym kierunku (poziomo lub pionowo), a następnie jedno pole prostopadle. Są to jedyne figury, które mogą przeskakiwać przez inne figury, co czyni je doskonałymi do poruszania się po zatłoczonej szachownicy i atakowania z niespodziewanych pozycji.",
    "bishopDisc": "Gońce poruszają się po przekątnej o dowolną liczbę pól w linii prostej. Każdy goniec zaczyna na polu określonego koloru (jasnym lub ciemnym) i musi pozostać na polach tego samego koloru przez całą partię. Oznacza to, że jeden goniec pokrywa wszystkie jasne pola, a drugi wszystkie ciemne pola.",
    "rookDisc": "Wieże to potężne figury poruszające się po liniach prostych, zdolne do przesuwania się o dowolną liczbę pól w poziomie lub pionie. Często są silnymi figurami w późniejszych etapach partii, gdy szachownica się otwiera. Wieże odgrywają również specjalną rolę w ruchu zwanym 'roszadą' z królem.",
    "queenDisc": "Hetman to najpotężniejsza figura na szachownicy, łącząca ruchy wieży i gońca. Może poruszać się o dowolną liczbę pól w dowolnym kierunku prostym — poziomo, pionowo lub po przekątnej. Jej wszechstronność sprawia, że jest ciągłym zagrożeniem dla przeciwnika.",
    "kingDisc": "Król to najważniejsza figura, mimo że porusza się tylko o jedno pole w dowolnym kierunku (poziomo, pionowo lub po przekątnej). Głównym celem gry jest 'zamatowanie' króla przeciwnika, co oznacza, że jest on atakowany i nie ma bezpiecznego pola, na które mógłby się ruszyć. Ochrona własnego króla jest najważniejsza dla wygrania partii.",

    "advancedMoves": "Zaawansowane ruchy",
    "tactics": "Taktyki",
    "castle": "Roszada",
    "enPassant": "En Passant",
    "pinning": "Przypięcie",
    "forks": "Widełki",
    "discoveredAttacks": "Atak z odsłony",


    "castleDisc": "Roszada to specjalny ruch w szachach, obejmujący króla i jedną z wież. Pozwala ona królowi przesunąć się o dwa pola w kierunku wieży, a następnie wieża przeskakuje na pole, przez które przeszedł król. Ruch ten może być wykonany tylko wtedy, gdy ani król, ani wieża nie ruszyły się wcześniej i nie ma między nimi żadnych figur.",
    "enPassantDisc": "Bicie w przelocie (z francuskiego 'en passant') to specjalne bicie piona w szachach. Następuje ono, gdy pion przeciwnika przesuwa się o dwa pola do przodu ze swojej pozycji początkowej i ląduje bezpośrednio obok twojego piona. W twoim najbliższym ruchu możesz zbić tego piona tak, jakby przesunął się tylko o jedno pole, lądując swoim pionem na polu, przez które pion przeciwnika 'przeszedł'.",
    "pinningDisc": "W szachach 'wiązanie' to sytuacja taktyczna, w której atakująca figura (zazwyczaj wieża, goniec lub hetman) uniemożliwia figurze przeciwnika ruch bez odsłaniania cenniejszej figury lub celu za nią. Jeśli figura jest związana z królem, jest to 'wiązanie absolutne' i związana figura nie może legalnie się ruszyć, ponieważ postawiłoby to króla w szachu. Jeśli jest związana z mniej cenną figurą (jak hetman czy wieża), jest to 'wiązanie względne', co oznacza, że figura może się ruszyć, ale skutkowałoby to stratą materiału.",
    "forksDisc": "W szachach 'widełki' to manewr taktyczny, w którym pojedyncza atakująca figura zagraża jednocześnie dwóm lub więcej figurom przeciwnika. Przeciwnik zazwyczaj może przesunąć tylko jedną z zagrożonych figur w bezpieczne miejsce, co prowadzi do utraty drugiej. Skoczki są szczególnie dobre w tworzeniu widełek ze względu na ich unikalny ruch w kształcie litery 'L', ale inne figury, takie jak gońce, wieże, hetmany, a nawet piony, również mogą wykonywać widełki.",
    "discoveredAttacksDisc": "W szachach 'atak z odsłony' ma miejsce, gdy przesuwasz jedną ze swoich figur, odsłaniając ukryty atak innej figury znajdującej się za nią. Tworzy to jednocześnie dwa zagrożenia, często zaskakując przeciwnika, ponieważ zazwyczaj może on zareagować tylko na jedno z nich. Kiedy odsłonięty atak jest szachem, nazywa się go 'szachem z odsłony', co jest szczególnie potężne, ponieważ przeciwnik musi zareagować na szach, co często pozwala ci zbić drugą zagrożoną figurę.",

    "languageDisc" : "Ustaw język",
    "customFen": "Własna pozycja w FEN",

    "useAnimations": "Animacje",
    "botError": "Błąd Bota"

}